cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"
tap "teamookla/speedtest"

brew "spaceship"

# Essentials
# ===
brew "git-extras"
brew "htop"
brew "thefuck"
brew "wget"
brew "tig"
brew "hstr"
brew "openssl"

brew "python3"
brew "pylint"
brew "pre-commit"
brew "black"

cask "docker"
cask "karabiner-elements"
cask "discord"
cask "scroll-reverser"
cask "raycast"
cask "maccy"
cask "iterm2"
cask "signal"
cask "google-chrome"
cask "visual-studio-code"
cask "vlc"
cask "spotify"
